results/10k-gateway.txt
/ # wrk -t 4 -c 200 -d 60s -R 10000 --latency -s /req-body.lua http://localhost:9080/v1/ch
at/completions
Running 1m test @ http://localhost:9080/v1/chat/completions
  4 threads and 200 connections
  Thread calibration: mean lat.: 3780.871ms, rate sampling interval: 12435ms
  Thread calibration: mean lat.: 4562.302ms, rate sampling interval: 13336ms
  Thread calibration: mean lat.: 3021.913ms, rate sampling interval: 12181ms
  Thread calibration: mean lat.: 3017.809ms, rate sampling interval: 12189ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.78s    10.57s   44.34s    58.46%
    Req/Sec   650.60     20.77   678.00     60.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.87s 
 75.000%   35.23s 
 90.000%   40.24s 
 99.000%   43.55s 
 99.900%   44.07s 
 99.990%   44.30s 
 99.999%   44.34s 
100.000%   44.37s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6655.999     0.000000            2         1.00
   11018.239     0.100000        12973         1.11
   15024.127     0.200000        25940         1.25
   18481.151     0.300000        38936         1.43
   22118.399     0.400000        51871         1.67
   25870.335     0.500000        64822         2.00
   27738.111     0.550000        71339         2.22
   29622.271     0.600000        77815         2.50
   31522.815     0.650000        84277         2.86
   33357.823     0.700000        90760         3.33
   35225.599     0.750000        97256         4.00
   36044.799     0.775000       100546         4.44
   36634.623     0.800000       103868         5.00
   37355.519     0.825000       106983         5.71
   38338.559     0.850000       110231         6.67
   39354.367     0.875000       113499         8.00
   39813.119     0.887500       115144         8.89
   40239.103     0.900000       116770        10.00
   40697.855     0.912500       118332        11.43
   41189.375     0.925000       119905        13.33
   41680.895     0.937500       121606        16.00
   41910.271     0.943750       122435        17.78
   42106.879     0.950000       123170        20.00
   42336.255     0.956250       124025        22.86
   42532.863     0.962500       124767        26.67
   42762.239     0.968750       125624        32.00
   42860.543     0.971875       125985        35.56
   42991.615     0.975000       126451        40.00
   43122.687     0.978125       126893        45.71
   43220.991     0.981250       127246        53.33
   43319.295     0.984375       127609        64.00
   43384.831     0.985938       127842        71.11
   43450.367     0.987500       128077        80.00
   43515.903     0.989062       128315        91.43
   43548.671     0.990625       128432       106.67
   43614.207     0.992188       128640       128.00
   43646.975     0.992969       128748       142.22
   43679.743     0.993750       128861       160.00
   43712.511     0.994531       128944       182.86
   43745.279     0.995313       129020       213.33
   43810.815     0.996094       129161       256.00
   43843.583     0.996484       129229       284.44
   43843.583     0.996875       129229       320.00
   43876.351     0.997266       129281       365.71
   43909.119     0.997656       129328       426.67
   43941.887     0.998047       129378       512.00
   43974.655     0.998242       129415       568.89
   44007.423     0.998437       129453       640.00
   44007.423     0.998633       129453       731.43
   44040.191     0.998828       129491       853.33
   44072.959     0.999023       129520      1024.00
   44072.959     0.999121       129520      1137.78
   44105.727     0.999219       129545      1280.00
   44105.727     0.999316       129545      1462.86
   44138.495     0.999414       129563      1706.67
   44138.495     0.999512       129563      2048.00
   44171.263     0.999561       129578      2275.56
   44171.263     0.999609       129578      2560.00
   44204.031     0.999658       129592      2925.71
   44204.031     0.999707       129592      3413.33
   44236.799     0.999756       129600      4096.00
   44236.799     0.999780       129600      4551.11
   44269.567     0.999805       129612      5120.00
   44269.567     0.999829       129612      5851.43
   44269.567     0.999854       129612      6826.67
   44269.567     0.999878       129612      8192.00
   44269.567     0.999890       129612      9102.22
   44302.335     0.999902       129620     10240.00
   44302.335     0.999915       129620     11702.86
   44302.335     0.999927       129620     13653.33
   44302.335     0.999939       129620     16384.00
   44302.335     0.999945       129620     18204.44
   44302.335     0.999951       129620     20480.00
   44335.103     0.999957       129625     23405.71
   44335.103     0.999963       129625     27306.67
   44335.103     0.999969       129625     32768.00
   44335.103     0.999973       129625     36408.89
   44335.103     0.999976       129625     40960.00
   44335.103     0.999979       129625     46811.43
   44335.103     0.999982       129625     54613.33
   44335.103     0.999985       129625     65536.00
   44335.103     0.999986       129625     72817.78
   44335.103     0.999988       129625     81920.00
   44335.103     0.999989       129625     93622.86
   44335.103     0.999991       129625    109226.67
   44367.871     0.999992       129626    131072.00
   44367.871     1.000000       129626          inf
#[Mean    =    25784.279, StdDeviation   =    10572.097]
#[Max     =    44335.104, Total count    =       129626]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  155805 requests in 1.00m, 74.44MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:   2596.68
Transfer/sec:      1.24MB