results/1k-direct.txt
/ # wrk -t 4 -c 50 -d 30s -R 1000 --latency -s /req-body.lua http://localhost:1980/v1/chat
/completions
Running 30s test @ http://localhost:1980/v1/chat/completions
  4 threads and 50 connections
  Thread calibration: mean lat.: 0.738ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.731ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.644ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.723ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   736.13us  378.22us   4.42ms   67.08%
    Req/Sec   263.05     90.84   555.00     80.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  721.00us
 75.000%    1.00ms
 90.000%    1.19ms
 99.000%    1.76ms
 99.900%    2.32ms
 99.990%    3.73ms
 99.999%    4.42ms
100.000%    4.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.053     0.000000            1         1.00
       0.257     0.100000         1998         1.11
       0.378     0.200000         3994         1.25
       0.493     0.300000         5994         1.43
       0.608     0.400000         7984         1.67
       0.721     0.500000         9974         2.00
       0.776     0.550000        10978         2.22
       0.833     0.600000        11971         2.50
       0.887     0.650000        12966         2.86
       0.942     0.700000        13964         3.33
       1.001     0.750000        14961         4.00
       1.029     0.775000        15455         4.44
       1.058     0.800000        15964         5.00
       1.084     0.825000        16450         5.71
       1.113     0.850000        16950         6.67
       1.143     0.875000        17463         8.00
       1.163     0.887500        17702         8.89
       1.189     0.900000        17944        10.00
       1.220     0.912500        18197        11.43
       1.254     0.925000        18445        13.33
       1.296     0.937500        18693        16.00
       1.319     0.943750        18816        17.78
       1.345     0.950000        18942        20.00
       1.377     0.956250        19065        22.86
       1.424     0.962500        19191        26.67
       1.468     0.968750        19313        32.00
       1.498     0.971875        19377        35.56
       1.527     0.975000        19440        40.00
       1.566     0.978125        19499        45.71
       1.610     0.981250        19562        53.33
       1.667     0.984375        19625        64.00
       1.703     0.985938        19655        71.11
       1.721     0.987500        19686        80.00
       1.746     0.989062        19718        91.43
       1.782     0.990625        19749       106.67
       1.822     0.992188        19781       128.00
       1.863     0.992969        19795       142.22
       1.889     0.993750        19811       160.00
       1.908     0.994531        19826       182.86
       1.935     0.995313        19842       213.33
       1.946     0.996094        19858       256.00
       1.955     0.996484        19865       284.44
       1.965     0.996875        19873       320.00
       1.988     0.997266        19881       365.71
       2.013     0.997656        19889       426.67
       2.033     0.998047        19897       512.00
       2.036     0.998242        19900       568.89
       2.051     0.998437        19905       640.00
       2.079     0.998633        19908       731.43
       2.121     0.998828        19912       853.33
       2.317     0.999023        19916      1024.00
       2.481     0.999121        19918      1137.78
       2.629     0.999219        19920      1280.00
       2.955     0.999316        19922      1462.86
       3.075     0.999414        19924      1706.67
       3.099     0.999512        19926      2048.00
       3.141     0.999561        19927      2275.56
       3.147     0.999609        19928      2560.00
       3.223     0.999658        19929      2925.71
       3.493     0.999707        19930      3413.33
       3.527     0.999756        19931      4096.00
       3.527     0.999780        19931      4551.11
       3.617     0.999805        19932      5120.00
       3.617     0.999829        19932      5851.43
       3.731     0.999854        19933      6826.67
       3.731     0.999878        19933      8192.00
       3.731     0.999890        19933      9102.22
       4.059     0.999902        19934     10240.00
       4.059     0.999915        19934     11702.86
       4.059     0.999927        19934     13653.33
       4.059     0.999939        19934     16384.00
       4.059     0.999945        19934     18204.44
       4.419     0.999951        19935     20480.00
       4.419     1.000000        19935          inf
#[Mean    =        0.736, StdDeviation   =        0.378]
#[Max     =        4.416, Total count    =        19935]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29995 requests in 30.00s, 13.64MB read
Requests/sec:    999.78
Transfer/sec:    465.72KB